"""1. Каждое из слов «разработка», «сокет», «декоратор» представить в строковом формате и проверить тип и содержание
соответствующих переменных. Затем с помощью онлайн-конвертера преобразовать строковые представление в формат Unicode
и также проверить тип и содержимое переменных."""

print('разработка')
print(type('разработка'))
print(type('\u0440\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u043a\u0430'))

print('декоратор')
print(type('декоратор'))
print(type('\u0434\u0435\u043a\u043e\u0440\u0430\u0442\u043e\u0440'))

print('сокет')
print(type('сокет'))
print(type('\u0441\u043e\u043a\u0435\u0442'))



